---
type: BaseArray
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# BaseArray

`Autodesk.Revit.DB.BaseArray` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetCopiedMemberIds | 2013 | `public abstract ICollection < ElementId > GetCopiedMemberIds ()` |
| Method | GetOriginalMemberIds | 2013 | `public abstract ICollection < ElementId > GetOriginalMemberIds ()` |
| Property | Label | — | `public FamilyParameter Label { get ; set ; }` |
| Property | Name | — | `public override string Name { set ; }` |
| Property | NumMembers | — | `public abstract int NumMembers { get ; set ; }` |
| Property | Parameter | — | `` |